app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
---
  def index
    @articles = Article.all

SELECT "articles".* FROM "articles"
---
  def new
    @articles = Article.all

INSERT INTO "articles" ("category", "title", "content", "tab1", "tab2", "tab3", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["category", ""], ["title", ""], ["content", "aaaaああああああ\r\n"], ["tab1", ""], ["tab2", ""], ["tab3", ""], ["created_at", "2017-10-01 02:44:01.773432"], ["updated_at", "2017-10-01 02:44:01.773432"]]
---
  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save

UPDATE "articles" SET "tab1" = ?, "tab2" = ?, "tab3" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["tab1", "問題問題問題問題問題問題問題問題問題問題問題"], ["tab2", "ヒントヒントヒントヒントヒントヒントヒントヒント"], ["tab3", "解答解答解答解答解答解答解答解答解答"], ["updated_at", "2017-10-01 02:55:54.013428"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @article.update(article_params)

DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 2]]
---
  def destroy
    @article.destroy

SELECT "articles".* FROM "articles"
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_article
      @articles = Article.all
      @article = Article.find(params[:id])