app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories"
---
  def index
    @categories = Category.all

INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "教育"], ["created_at", "2017-10-09 07:33:56.753975"], ["updated_at", "2017-10-09 07:33:56.753975"]]
---
  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save

UPDATE "categories" SET "name" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["name", "ふぃえふぇっl"], ["updated_at", "2017-10-09 08:10:11.718820"], ["id", 8]]
---
  def update
    respond_to do |format|
      if @category.update(category_params)

DELETE FROM "categories" WHERE "categories"."id" = ?  [["id", 4]]
---
  def destroy
    @category.destroy

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
    def set_category
      @category = Category.find(params[:id])