app/controllers/math_works_controller.rb

  def index
    @math_works = MathWork.all
---
SELECT "math_works".* FROM "math_works"

  def create
    @math_work = MathWork.new(math_work_params)

    respond_to do |format|
      if @math_work.save
---
INSERT INTO "math_works" ("digit1", "digit2", "operator", "times", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["digit1", 2], ["digit2", 2], ["operator", 1], ["times", 1], ["created_at", "2017-09-23 06:51:11.445852"], ["updated_at", "2017-09-23 06:51:11.445852"]]

  def update
    respond_to do |format|
      if @math_work.update(math_work_params)
---
UPDATE "math_works" SET "times" = ?, "updated_at" = ? WHERE "math_works"."id" = ?  [["times", 4], ["updated_at", "2017-09-24 02:29:49.970695"], ["id", 1]]

  def destroy
    @math_work.destroy
---
DELETE FROM "math_works" WHERE "math_works"."id" = ?  [["id", 4]]

    def set_math_work
      @math_work = MathWork.find(params[:id])
---
SELECT  "math_works".* FROM "math_works" WHERE "math_works"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]