app/controllers/writings_controller.rb

  def index
    @writings = Writing.all
---
SELECT "writings".* FROM "writings"

  def create
    @writing = Writing.new(writing_params)

    respond_to do |format|
      if @writing.save
---
INSERT INTO "writings" ("question", "correct", "hint", "explanation", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["question", "こんにちは、世界"], ["correct", "hello world"], ["hint", "he"], ["explanation", "はじめはここから！"], ["created_at", "2017-09-17 02:29:48.745611"], ["updated_at", "2017-09-17 02:29:48.745611"]]

  def destroy
    @writing.destroy
---
DELETE FROM "writings" WHERE "writings"."id" = ?  [["id", 4]]

    def set_writing
      @writing = Writing.find(params[:id])
---
SELECT  "writings".* FROM "writings" WHERE "writings"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]